Revit 2027 API
IFCProductWrapper.AddSite Method
 Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSite(
	IFCAnyHandle siteHandle
)
Public Sub AddSite (
	siteHandle As IFCAnyHandle
)
public:
void AddSite(
	IFCAnyHandle^ siteHandle
)
member AddSite :
        siteHandle : IFCAnyHandle -> unit
Parameters
siteHandle IFCAnyHandle
 The site handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace